USE dota2;
CREATE TABLE dota_news(
    id INT PRIMARY KEY AUTO_INCREMENT,
    nId INT,
    title VARCHAR(255),
    news VARCHAR(4096),
    img VARCHAR(255),
    news_date DATE
)
 INSERT INTO dota_news VALUES(null,1,"DOTA2真视界——TI8总决赛纪录片","","http://176.30.9.205:3000/img/news/t1.jpg","");
 INSERT INTO dota_news VALUES(null,1,"【攻略】最容易被忽略的团战之王","","http://176.30.9.205:3000/img/news/t2.jpg","");
 INSERT INTO dota_news VALUES(null,2,"DOTA2真视界——TI8总决赛纪录片","两支队伍，十人追梦。冠军神盾终究只有一面，胜利者喜悦的同时，也注定会有失意者的落寞。2019再战上海，风霜后的果实才分外甜美。","http://176.30.9.205:3000/img/news/t1.jpg","2019-1-16");
 INSERT INTO dota_news VALUES(null,2,"DOTA2 1月16日更新：迎霜节的珍藏商家","1月16日更新：迎霜节的珍藏II上架，这份迟来的迎霜节礼物中包含昆卡、光之守卫、德鲁伊、沙王、工程师、撼地者、斯温、主宰、裂魂人、沉默术士、剃刀、不朽尸王、树精卫士、狼人、血魔、幻影长矛手、卓尔游侠、巫妖的套装，其中幻影长矛手和卓尔游侠为珍稀，巫妖为非常珍稀。","http://176.30.9.205:3000/img/news/n1.jpg","2019-1-16");
 INSERT INTO dota_news VALUES(null,2,"DOTA2 12月20日更新：拉比克至宝与凌霜圣地活动上线","陷入解密和重塑奥术的狂热后，大魔导师拉比克召集暴徒向凌霜圣地进军，意指根除原初的迎霜节宝树，探索树下神秘的力量源泉。为了阻止误入歧途的魔导师，五名英雄必须奋起防守远古宝树——为拯救迎霜节的节日精神奋战到底！","http://176.30.9.205:3000/img/news/n2.jpg","2018-12-20");
 INSERT INTO dota_news VALUES(null,2,"英特尔杯完美世界城市挑战赛2019“跨年场”于成都落幕","12月31日，踩着2018的尾巴，英特尔杯完美世界城市挑战赛总决赛在成都金牛万达广场打响，现场汇集众多DOTA2和CS:GO的游戏粉丝，浓浓的电竞氛围更让周围的人停留驻步，一起加入其中。四支决赛队伍摩拳擦掌，谁都想最终捧杯，问鼎全国。","http://176.30.9.205:3000/img/news/n3.jpg","2019-1-07");
 INSERT INTO dota_news VALUES(null,2,"1个至宝=115个英雄特效 最“绿”至宝拉比克“魔导师密钥”登场","1个至宝=115个英雄特效 最“绿”至宝拉比克“魔导师密钥”登场","http://176.30.9.205:3000/img/news/n4.jpg","2018-12-28");
 INSERT INTO dota_news VALUES(null,2,"​完美盛典玩点新花样 当Yang的AK对上玩机器的敌法师","完美盛典齐聚国内各大战队的明星选手，这样的场合怎能缺了精彩的对抗。","http://176.30.9.205:3000/img/news/n8.jpg","2018-12-10");
 INSERT INTO dota_news VALUES(null,2,"英雄所敬略同：2018完美盛典圆满闭幕","12月16日，年度电竞盛宴完美盛典在上海静安体育中心体育馆盛大举行。","http://176.30.9.205:3000/img/news/n5.jpg","2018-12-17");
 INSERT INTO dota_news VALUES(null,2,"完美盛典线下和线上观礼攻略","12月16日（本周日），第三届完美盛典将在上海静安体育中心体育馆（上海市静安区汶水路116号的静安体育中心体育馆）举行。","http://176.30.9.205:3000/img/news/n6.jpg","2018-12-15");
 INSERT INTO dota_news VALUES(null,2,"看2018完美盛典 现场免费送TI9门票","做为一位信仰粉。还有什么比能去TI现场观看比赛更令人兴奋吗？","http://176.30.9.205:3000/img/news/n5.jpg","2018-12-11");
 INSERT INTO dota_news VALUES(null,2,"DOTA2 12月20日更新：拉比克至宝与凌霜圣地活动上线","陷入解密和重塑奥术的狂热后，大魔导师拉比克召集暴徒向凌霜圣地进军，意指根除原初的迎霜节宝树，探索树下神秘的力量源泉。为了阻止误入歧途的魔导师，五名英雄必须奋起防守远古宝树——为拯救迎霜节的节日精神奋战到底！","http://176.30.9.205:3000/img/news/n2.jpg","2018-12-20");
 INSERT INTO dota_news VALUES(null,2,"DOTA2 12月10日更新日志：7.20e平衡性更新","DOTA2 12月10日更新日志：7.20e平衡性更新","http://176.30.9.205:3000/img/news/n7.jpg","2018-12-10");
  INSERT INTO dota_news VALUES(null,2,"DOTA2真视界——TI8总决赛纪录片","两支队伍，十人追梦。冠军神盾终究只有一面，胜利者喜悦的同时，也注定会有失意者的落寞。2019再战上海，风霜后的果实才分外甜美。","http://176.30.9.205:3000/img/news/t1.jpg","2019-1-16");
  INSERT INTO dota_news VALUES(null,2,"英雄所敬略同：2018完美盛典圆满闭幕","12月16日，年度电竞盛宴完美盛典在上海静安体育中心体育馆盛大举行。","http://176.30.9.205:3000/img/news/n5.jpg","2018-12-17");
 INSERT INTO dota_news VALUES(null,2,"DOTA2 1月16日更新：迎霜节的珍藏商家","1月16日更新：迎霜节的珍藏II上架，这份迟来的迎霜节礼物中包含昆卡、光之守卫、德鲁伊、沙王、工程师、撼地者、斯温、主宰、裂魂人、沉默术士、剃刀、不朽尸王、树精卫士、狼人、血魔、幻影长矛手、卓尔游侠、巫妖的套装，其中幻影长矛手和卓尔游侠为珍稀，巫妖为非常珍稀。","http://176.30.9.205:3000/img/news/n1.jpg","2019-1-16");
 INSERT INTO dota_news VALUES(null,2,"看2018完美盛典 现场免费送TI9门票","做为一位信仰粉。还有什么比能去TI现场观看比赛更令人兴奋吗？","http://176.30.9.205:3000/img/news/n5.jpg","2018-12-11");
 INSERT INTO dota_news VALUES(null,2,"完美盛典线下和线上观礼攻略","12月16日（本周日），第三届完美盛典将在上海静安体育中心体育馆（上海市静安区汶水路116号的静安体育中心体育馆）举行。","http://176.30.9.205:3000/img/news/n6.jpg","2018-12-15");
 INSERT INTO dota_news VALUES(null,2,"DOTA2 1月16日更新：迎霜节的珍藏商家","1月16日更新：迎霜节的珍藏II上架，这份迟来的迎霜节礼物中包含昆卡、光之守卫、德鲁伊、沙王、工程师、撼地者、斯温、主宰、裂魂人、沉默术士、剃刀、不朽尸王、树精卫士、狼人、血魔、幻影长矛手、卓尔游侠、巫妖的套装，其中幻影长矛手和卓尔游侠为珍稀，巫妖为非常珍稀。","http://176.30.9.205:3000/img/news/n1.jpg","2019-1-16");
 INSERT INTO dota_news VALUES(null,2,"DOTA2 12月10日更新日志：7.20e平衡性更新","DOTA2 12月10日更新日志：7.20e平衡性更新","http://176.30.9.205:3000/img/news/n7.jpg","2018-12-10");
  INSERT INTO dota_news VALUES(null,2,"DOTA2真视界——TI8总决赛纪录片","两支队伍，十人追梦。冠军神盾终究只有一面，胜利者喜悦的同时，也注定会有失意者的落寞。2019再战上海，风霜后的果实才分外甜美。","http://176.30.9.205:3000/img/news/t1.jpg","2019-1-16");
 INSERT INTO dota_news VALUES(null,2,"看2018完美盛典 现场免费送TI9门票","做为一位信仰粉。还有什么比能去TI现场观看比赛更令人兴奋吗？","http://176.30.9.205:3000/img/news/n5.jpg","2018-12-11");
  INSERT INTO dota_news VALUES(null,2,"​完美盛典玩点新花样 当Yang的AK对上玩机器的敌法师","完美盛典齐聚国内各大战队的明星选手，这样的场合怎能缺了精彩的对抗。","http://176.30.9.205:3000/img/news/n8.jpg","2018-12-10");
