USE dota2;
CREATE TABLE dota_newText(
    id INT PRIMARY KEY AUTO_INCREMENT,
    imgid INT,
    new_date DATE,
    title VARCHAR(255),
    new_header VARCHAR(4096),
    new_text VARCHAR(4096),
    new_footer VARCHAR(4096) 
)

INSERT INTO dota_newText VALUES(
    null,

    1,

    "2019-1-15",

    "“欢迎回家” 恭喜EHOME斩获布加勒斯特Minor冠军晋级重庆Major",

    "1月14日凌晨，本赛季第二个Minor——布加勒斯特Minor结束了最后一场比赛，来自中国的战队EHOME以3比1的总比分击败欧洲新晋强队Gambit，夺得本届Minor冠军，也借此获得了即将开始的重庆Major的最后一个参赛资格。回顾本届比赛，两支中国战队都有着不错的表现，这也让我们对接下来的重庆Major和其他比赛都充满了期待。",

    "这支EHOME带给观众最多的，是惊叹。惊叹于阵容可以这样选，配合可以这样打，团战可以这样拉扯。当他们面对TI8冠军OG，五人祭出虚灵权杖应对输出爆表的卓尔游侠，精彩拉扯完成逆转；再由小小和上古巨神打出精妙的团战配合，拉比克则让OG仿佛在面对凌霜圣地中的奥术至尊！当他们在胜者组决赛中对阵强敌Gambit时，兽王抢盾稳住局面，圣剑狙击手火力全开终结70分钟大战。而在决赛中，首局比赛，哈斯卡沸血之矛如雨，EHOME旗开得胜；第二局Gambit发挥更胜一筹，敌法师和先知助他们扳平比分；第三局在杰奇洛的冰封路径中影魔奏响魂之挽歌为EHOME拿到赛点；随着空血的无双魅影死战不退刀刀烈火，Gambit的遗迹轰然倒塌！有经验丰富的教练制定战术，有冠军选手坐镇指挥，有年轻新人一往无前，这支EHOME未来可期。Minor冠军是荣誉，更是新的开始。",

    "由于独特的赛制，KG与NiP在本届Minor上先后交手三次，而KG全部取得了胜利，这三次交手，KG先将NiP锤进败者组，之后直接淘汰NiP，虽然NiP拥有着多位能征惯战的名将，但在KG面前，还是被打出了6-1的比分。 KG，这支在中国强队之林中并不显眼的队伍，这一次在国际大赛上亮出了他们的锋芒。虽然不敌Gambit，但是KG的表现，已经足够亮眼，也希望他们总结经验，在后面的比赛中取得好的成绩。 诚然，Minor级别的赛事规模不如Major，队伍也不是那么星光熠熠；诚然，TI8冠军OG在ana离队后似乎状态不佳……但是，两支中国战队的表现都足够亮眼，而他们的多变的打法、精妙的配合，都让我们看到了新一年中，中国战队新的希望。"
);
INSERT INTO dota_newText VALUES(
    null,

    2,

    "2019-1-5",

    "“英特尔杯完美世界城市挑战赛2019“跨年场”于成都落幕",

    "12月31日，踩着2018的尾巴，英特尔杯完美世界城市挑战赛总决赛在成都金牛万达广场打响，现场汇集众多DOTA2和CS:GO的游戏粉丝，浓浓的电竞氛围更让周围的人停留驻步，一起加入其中。四支决赛队伍摩拳擦掌，谁都想最终捧杯，问鼎全国。不光有比赛，现场更有趣味射箭游戏和冠军队伍竞猜环节给到场的每一位小伙伴送上精美福利。况且有英特尔爸爸助阵，又怎能少得了游戏利器—Intel i7-8086K！现场有多位玩家成为幸运儿把此等神器抱回家，这个2019绝对天梯冲上冠绝，打枪爆头率蹭蹭往上涨。另一边美女COSER和帅气“海豹突击队成员”更是与众多DOTA2、CS:GO玩家们亲密互动，我们的这位“海豹突击队成员”不光装备精良，还是位狂热的CS:GO玩家，这哪是COSER，这就是CSER！瞧这位玩家站在“包点”，拿着AK架个枪，就是一个字“狠”，看谁敢来拆包！",

    "本次“跨年场”可谓颇具看点，DOTA2项目武汉、上海再次相遇，成都CS:GO本地东道主迎战南京劲旅，强队间激烈碰撞，上演世纪大战。上届城市挑战赛DOTA2项目冠军城市—武汉，始终是夺冠热门，而上届亚军城市—上海自然是不服，本次登上总决赛的舞台试图再较高下，一绝雌雄。战幕拉开，上海SUIBE战队攻势猛烈，战术迅猛激进，给予了对方极大的线上压力，但显然武汉This is power战队准备更加充分，多次抓住对方漏洞滚起雪球拉开差距，转守为攻。最终武汉This is power以2:0的比分战胜上海SUIBE战队，夺得了完美世界城市挑战赛秋季赛的总冠军以及DAC的直邀预选名额。也为武汉这座电竞之城再一次卫冕了DOTA2最强城市，尽显王者姿态。 ",

    "这一年我们走遍全国，和玩家一起分享DOTA2及CS:GO的乐趣，与玩家们一起在游戏成长，游戏给我们带来了快乐，而我们也让游戏充满活力。感受别样的电竞魅力，谱写不同的城市传奇！伴随着新年钟声的敲响，面对2018年我们只得道声“再见”，英特尔杯完美世界城市挑战赛也已经结束。然2019年已悄然而至，新的征程等待着每一位小伙伴，新的传奇诗篇等待着大家齐力书写！你好！2019！新赛季，我们再相遇！"
);